<?php include ("meno.php")?>

<div class="img-header">
    <h1>بک اند (back end) </h1>


</div>


<center>
    <p id="mt1">
        بک اند "Backend" چیست؟
        بک اند "Backend" عموما از سه بخش تشکیل می شود: یک سرور، یک برنامه و یک پایگاه داده
        ها دیتا بیس. اگر به عنوان مثال قصد خرید یک بلیت از وب سایتی را داشته باشید، معمولا سایت را
        باز میکنید و با فرانت اند "Frontend" تعامل می کنید. زمانی که اطلاعات را وارد کردید، برنامه آن
        اطلاعات را در پایگاه داده هایی که روی سرور قرار دارد ذخیره می کند .
        تمام اطلاعاتی که وارد کردید در سرور باقی می مانند و مثلا زمانی که برای پرینت بلیت دوباره وارد
        حساب کاربری آن وب سایت شوید، تمام آنها برای شما قابل مشاهده می باشند .
        فردی که با استفاده از تمام این تکنولوژی ها استفاده می کند تا با یکدیگر کار کنند توسعه دهنده بک
        اند "Backend Developer" می گوییم. تکنولوژی های بک اند عموما شامل زبانهای برنامه نویسی
        مانند PHP ، Ruby ، Python و غیره می باشند. همچنین برای اینکه این تکنولوژی ها آسان تر نیز
        شوند گاهی از فریم ورک هایی مانند Ruby on Rails ، Cake PHP و ... برای سرعت دادن به
        توسعه برنامه استفاده می شود .
        بسیاری از افرادی که به تازگی وارد این شاخه کاری می شوند، بسیار کلماتی مانند وردپرس، جوملا،
        دروپال و ... را می شوند. به عنوان مثال وردپرس یک مثال بسیار خوب برای کارکرد فرانت اند و
        بک اند با هم می باشد. چرا که وردپرس بر اساس یک فریم ورک کد باز بر اساس زبان برنامه
        نویسی PHP به سادگی بر روی یک سرور به همراه دیتابیس قابل نصب می باشد و سپس طراحان
        عملکردها و ظاهر سایت را با استفاده از کد نویسی انجام می دهند
        <br>
        مقایسه با بک اند
        در ادامهی پاسخ به سوال فرانت اند چیست ، خوب است که یک مقایسهای هم از فرانت اند و بک اند داشته
        باشیم .
        در نقطهی مقابل Front End ، واژه و مفهوم Back End وجود دارد که اینگونه معنا میشود :
        برنامه نویسی بک اند (Back End) مربوط به کدنویسی و برنامه نویسی هر آن چیزی است که کاربر
        آن را مشاهده نمیکند و مربوط به کارهای پشت صحنه وب سایت است. در واقع وقتی که یک وبسایت،
        مقالات را از دیتابیس دریافت میکند، یک امر مربوط به بک اند است. وظیفهی یک برنامه نویس بک
        اند، برنامه نویسی چیزهایی است که هسته اصلی یک وبسایت هستند و کاربر کدهای آنرا بصورت
        مستقیم مشاهده نمیکند
        <br>
        برای اینکه این دو مفهوم را بهتر متوجه شوید، یک اجرای تئاتر را در نظر بگیرید . اگر یک تئاتر بخواهد
        اجرا شود، به دو گروه از افراد نیاز دارد :
         بازیگرهایی که اجرای صحنهی تئاتر را بر عهده دارند
         نویسنده، کارگردان، تهیه کننده، نورپردازی و… که بصورت مستقیم روی صحنه نمی آیند، ولی
        تاثیر کار آنها در اجرای تئاتر موثر است .
        دو حیطهی مختلف Front End و Back End نیز دقیقا به همین صورت است :
         تمام آن چیزی که مربوط به ظاهر سایت میباشد مثل بازیگران در صحنه تئاتر مربوط به
        اجرای Front End.
         و تمام آن چیزی که مربوط به کارهای پشت صحنه سایت میباشد مثل کارگردان و تهیه کننده که
        در پشت صحنه هستند با نام Back End شناخته میشود.
    </p>
</center>



<footer>

    <p>
        راه های ارتباطی ما
        <br>
        شماره تماس با ما 0935860280
        <br>
        ایدی تلگرام ما  amozesh@
    </p>

</footer>

    <script src="js.js"></script>
</html>