<?php include ("meno.php")?>
<div class="img-header">
    <h1>فرانت اند (frot end) </h1>


</div>

<center>
    <p id="mt1">
        تعریف واژه ی فرانت اند
        Front End چیست: در عبارت Front End ، هما x نطور که میبینید واژه ی Front وجود دارد. و در
        انگلیسی یکی از معانی Front میباشد » جلو « ، به معنای .
        در دیکشنری آنلاین فست دیک، معنی واژهی Front به این صورت آمده است: جلو، پیش، صف پیش،
        نما، طرز برخورد، جلودار، منادی،جبهه جنگ، بطرف جلو، روکردن به، مواجه شده با،روبروی هم قرار
        دادن، مقدمه نوشتن بر، درصف جلوقرارگرفتن
        با توجه به تعریفی که از این واژه دیدیم، میتوانیم در پاسخ به سوال Front End چیست بگوییم :
        طراحی یا کدنویسی هر آن چیزی که مربوط به جلوی وبسایت میشود. در واقع یک طراح وب یا یک
        Front End Developer ، کسی است که چیزی را طراحی میکند کاربر آنرا میبیند
        <br>


        تفاوت برنامه نویس فرانت اند با UI Designer
        در ادامهی پاسخ به سوال Front End چیست میخواهیم کمی ریز تر به این مفهوم نگاه کنیم .
        اگر بخواهیم در دنیای طراحی وب کمی ریز تر و عمیق تر شویم، باز با ۲ مفهوم دیگر مواجه میشویم :
         برنامه نویس فرانت اند یا Front End Developer
         طراح رابط کاربری یا UI Designer (Ui ) مخفف User Interface میباشد .
        اما طراح رابط کاربری، کار متفاوتی انجام میدهد. کسی که با عنوان UI Designer کار میکند، کارهای
        مربوط به کدنویسی را انجام نمیدهد و هرگز خودش دست به کد نمیشود .
        بلکه یک طراح رابط کاربری، کارش طراحی گرافیک سایت در نرم افزارهایی مثل فتوشاپ
        (Photoshop) است. این افراد رابط کاربری و شکل ظاهری یک صفحه وب را در فتوشاپ یا سایر نرم
        افزارهای مشابه مثل Sketch طراحی میکنند و سپس فایل PSD را در اختیار آن شخصی میگذارند که
        کدنویسی فرانت اند را انجام میدهد و اصطلاحا فرانت اند دولوپر است .
        پس کار یک UI Designer صرفا با نرم افزارهای گرافیکیست و کاری با کدها ندارد، و کار یک طراح
        وب فرانت اند، با کد ها است و با کدنویسی میتواند صفحات وب مختلفی را طراحی کند
        <br>


        مهارت های یک طراح وب فرانت اند چیست
        برای تبدیل شدن به یک طراح وب فرانت اند، شما به مهارت های بسیاری نیاز دارید که همهی آنها
        برایتان کاربردی خواهد بود. در زیر بصورت خلاصه این مهارتها را عنوان میکنیم و در آینده در یک
        مقاله و آموزش تخصصی، درباره ی تمام مهارت هایی که برای تبدیل شدن به یک طراح وب فرانت اند
        نیاز داریم صحبت میکینم .
        لیست مهارت هایی که یک Front End Developer باشد داشته باشد :


         HTML
         CSS
         Javascript
         کتابخانه ها و فریمورک های جاوا اسکریپت مثل جی کوئری
         کتابخانههای CSS مثل بوت استرپ (Bootstrap)
         پردازنده های CSS مثل Sass یا Less
         طراحی وب واکنش گرا (Responsive Web Design)
         نرم افزارهای گرافیکی ( فتوشاپ و شاید کمی Illustrator)
         تست و آزمون خطا
         و مهارت جانی دیگری


    </ul>
    </p>

</center>

<footer>

    <p>
        راه های ارتباطی ما
        <br>
        شماره تماس با ما 093586028
        <br>
        ایدی تلگرام ما  amozesh@
    </p>

</footer>

<script src="js.js"></script>
</html>