<?php include ("meno.php")?>

<div class="img-header">
    <h1>مفاهیم اولیه برنامه نویسی وب </h1>



</div>


<center>   <div class="section"><div>
            <p class="psection"><a href="front.php" style="color: #8d0d19">frot end فرانت اند</a></p>
            برای خواندن مطالب بیشتر بر روی عنوان موضوع کلیک کنید

             </div></div>
    <div class="section">
        <p class="psection"> <a href="back.php" style="color:#8d0d19;">back end  بک اند</a></p></p>
        برای خواندن مطالب بیشتر بر روی عنوان موضوع کلیک کنید
    </div>

</center>

<center>
    <p id="mt1">
        در برنامه نویسی تحت وب از جمله مزیت هایی که نسبت به سایر زبان ها وجود داره این هست که شما نگران
        این نیستین که برنامه شما در هر سیستم عاملی اجرا بشه یا نه یا اینکه برنامه شما تحت شبکه باشه و برای
        همه قابل دسترس باشه . تفاوتی که برنامه نویسی تحت وب با برنامه نویسی برای سایر پلتفرم ها داره
        در اینه که شما در برنامه نویسی برای سایر سیستم عامل ها معمولا از یک زبان استفاده می کنین
        البته بسته به نوع برنامه می تونین از زبان های دیگه ای هم استفاده کنین ولی استفاده
        از یک زبان شرط کافی هست ولی در زبان برنامه نویسی تحت وب شما الزاما باید از دو قسم
        زبان کلاینت و سرور استفاده بکنین
    </p>
</center>
<center>
        <p id="mt1">
        زبان های قسمت کلاینت عبارتند از : Html , CSS , JavaScript , Jquery و ... که این زبان ها برای اجرا شدن نیازی به کمپایلر
        ندارن در واقع بیشتر به صورت اسکریپت هستن و شما این کد ها رو می تونین در مرور گر خودتون به صورت آفلاین و بدون نیاز
        به اینترنت و وب سرور اجرا کنین. در برنامه تحت وب معمولا از همه این زبان ها استفاده میشه که هر کدام نقش خاص خودش رو
        داره و به طور خلاصه میشه گفت Html عناصر برنامه ما رو تشکیل میده مثل فیلد های ورودی ، دکمه ها ، متن و تیتر و ... ،
        CSS برای ظاهر عناصر برنامه استفاده میشه مثل فونت و رنگ بندی و موقعیت ، طول و عرض و ... ، جاوا اسکریپت
        هم بیشتر برای ایجاد تغییرات در عناصر و توابع کاربرد دارد.
        </p>
</center>
<center>
    <p id="mt1">
        زبان های قسمت سرور عبارتند از: Asp.Net , Php , Java , Perl و ... که در برنامه نویسی تحت
        الزاما فقط یکی از این زبان ها استفاده می کنیم ، این زبان ها برای اجرا نیاز به کمپایلر دارن و برای اجرا
        باید نرم افزار مربوط به هریک بر روی سیستم شما نصب شود.
    </p>
</center>
<center>
    <div class="b">


        </div>
        <div class="card-text"><img src="image/img (2).jpg" alt="">
            <div class="text">
                خصوصیات (specification document) تعیین شدهاند ( برای مثال یک استاندارد ISO) ، در حالی که
                برخی دیگر دارای پیادهسازی غالبی میباشند .( مانند Perl) اولین زبان برنامهنویسی به قبل از اختراع رایانه
                بازمیگردد، و برای هدایت رفتار ماشینهایی مانند دستگاههای نساجی اتوماتیک و نوازندههای پیانو به کار
                میرفت . هزاران زبان برنامهنویسی خلق شدهاند، بیشتر در زمینهٔ رایانه، زمینهای که هر ساله بسیاری دیگر
                ایجاد میشوند .

            </div>

        </div>
        <div class="card-text"><img src="image/img (3).jpg" alt="">
            <div class="text">
                یک زبان برنامهنویسی یک زبان مصنوعی انگلیسی است که برای بیان محاسباتی که توسط یک ماشین
                )مخصوصا رایانه( قابل انجام است، طراحی شدهاست.زبانهای برنامهنویسی برای ایجاد برنامههایی به کار
                میروند که رفتار یک ماشین را مشخص میکنند، الگوریتم دقیق را بیان میکنند، یا روشی برای ارتباط
                انسانند . بسیاری از زبانهای برنامهنویسی تعدادی قالب از ویژگیهای نوشته شده دستوری (syntax) و
                معناشناسی (semantics) دارند، چرا که رایانهها دستورهای دقیقا مشخص نیاز دارند.
            </div>

        </div>
        <div class="card-text"><img src="image/img (5).jpg" alt="">
            <div class="text">
                برنامه نویسی چیست و از کجا شروع باید کرد ؟
                زبانهای برنامهنویسی ساختارهای زبانی دستور مداری در رایانهها هستند که بهوسیلهٔ آنها میتوان یک
                الگوریتم را بهوسیلهٔ ساختارهای دستوری متفاوت برای اجرای رایانه توصیف کرد و با این روش امکان
                نوشتن برنامه جهت تولید نرمافزارهای جدید به وجود میآید. معمولا هر زبان برنامهنویسی دارای یک محیط
                نرمافزاری برای وارد کردن متن برنامه، اجرا، همگردانی و رفع اشکال آن هستند
            </div>

        </div>
    </div>
</center>
</div>












<center>
    <p id="mt1">
        یک سیر رایج در گسترش زبانهای برنامهنویسی این است که قابلیت حل مسائلی با درجات انتزاعی بالاتری
        را اضافه کنند. زبانهای برنامهنویسی اولیه به سختافزار رایانه گره خورده بودند. همانطور که زبانهای
        برنامهنویسی جدید گسترش پیدا کردهاند، ویژگیهایی به برنامهها افزوده شده که به برنامهنویس اجازه دهد
        که ایدههایی که از ترجمه ساده به دستورهای سختافزار دورتر هستند نیز استفاده کند. چون برنامهنویسها
        کمتر به پیچیدگی رایانه محدود شدهاند، برنامههای آنها میتواند محاسبات بیشتری با تلاش کمتر از سوی
        برنامهنویس انجام دهند. این به آنها این امکان را میدهد که کارایی بیشتر در واحد زمان داشته باشند .
        پردازندههای زبان طبیعی به عنوان راهی برای ازبین بردن نیاز به زبانهای اختصاصی برنامهنویسی
        موافق بود که » ادسگر دیجسترا « . پیشنهاد شدهاند. هرچند، این هدف دور است و فواید آن قابل بحث است
        استفاده از یک زبان رسمی برای جلوگیری از مقدمهسازی ساختارهای بیمعنی واجب است، و زبان
        نیز مشابها این ایده را رد کرد » آلن پرلیس « ، رد کرد » احمقانه « برنامهنویسی طبیعی را با عنوان . مطابق
        با متدولوژی نامتجانس استفاده شده توسط langpop.com در سال ۲۰۰۸ ، ۱۲ زبان پرکاربرد عبارتند از : C, C++, C#, Java, JavaScript, Perl, PHP, Python, Ruby, Shell, SQL, and Visual Basic
    <br>
        المان ها
        تمام زبانهای برنامهنویسی تعدادی بلوکهای ابتدایی برای توضیح داده و پردازش یا تبدیل آنها )مانند جمع
        به وسیلهٔ قوانین معناشناسی » عناصر ابتدایی « کردن دو عدد با انتخاب یک عضو از یک مجموعه( دارند. این
        و دستوری تعریف میشوند که ساختار و معنای مربوط را توضیح میدهند
    </p>
</center>
<center>
<footer>

    <p>
       راه های ارتباطی ما
        <br>
      شماره تماس با ما  0935860280
        <br>
        ایدی تلگرام ما  amozesh@
    </p>

</footer>
    </center>
</body>
<script src="js.js"></script>
</html>
